saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/NXP.MK22D5_DFP.10.0.1.pdsc
    <condition id="RTE_Device_platform.CMSIS_Driver_Include.USART_CMSISInclude_device.MK22D5_driver.uart">
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <accept Dvendor="NXP:11" Dname="MK22DN512???5"/>
      <accept Dvendor="NXP:11" Dname="MK22DX128???5"/>
      <accept Dvendor="NXP:11" Dname="MK22DX256???5"/>
      <require Cclass="CMSIS Driver" Cgroup="USART" Csub="uart_cmsis" Capiversion="5.0.1"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
    </condition>
    <condition id="device.MK22D5_driver.dspi_driver.edma">
      <accept Dvendor="NXP:11" Dname="MK22DN512???5"/>
      <accept Dvendor="NXP:11" Dname="MK22DX128???5"/>
      <accept Dvendor="NXP:11" Dname="MK22DX256???5"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dspi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="device.MK22D5_driver.edma_driver.i2c">
      <accept Dvendor="NXP:11" Dname="MK22DN512???5"/>
      <accept Dvendor="NXP:11" Dname="MK22DX128???5"/>
      <accept Dvendor="NXP:11" Dname="MK22DX256???5"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
    </condition>
    <condition id="device.MK22D5_driver.edma_driver.uart">
      <accept Dvendor="NXP:11" Dname="MK22DN512???5"/>
      <accept Dvendor="NXP:11" Dname="MK22DX128???5"/>
      <accept Dvendor="NXP:11" Dname="MK22DX256???5"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
    </condition>
    <condition id="device.MK22D5_device.device_device_driver.edma">
      <accept Dvendor="NXP:11" Dname="MK22DN512???5"/>
      <accept Dvendor="NXP:11" Dname="MK22DX128???5"/>
      <accept Dvendor="NXP:11" Dname="MK22DX256???5"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="device.MK22D5_utility.debug_console">
      <accept Dvendor="NXP:11" Dname="MK22DN512???5"/>
      <accept Dvendor="NXP:11" Dname="MK22DX128???5"/>
      <accept Dvendor="NXP:11" Dname="MK22DX256???5"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
    <condition id="device.MK22D5_driver.common_driver.dmamux">
      <accept Dvendor="NXP:11" Dname="MK22DN512???5"/>
      <accept Dvendor="NXP:11" Dname="MK22DX128???5"/>
      <accept Dvendor="NXP:11" Dname="MK22DX256???5"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
    </condition>
    <condition id="device.MK22D5_driver.common">
      <accept Dvendor="NXP:11" Dname="MK22DN512???5"/>
      <accept Dvendor="NXP:11" Dname="MK22DX128???5"/>
      <accept Dvendor="NXP:11" Dname="MK22DX256???5"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MK22D5_driver.flash">
      <accept Dvendor="NXP:11" Dname="MK22DN512???5"/>
      <accept Dvendor="NXP:11" Dname="MK22DX128???5"/>
      <accept Dvendor="NXP:11" Dname="MK22DX256???5"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flash"/>
    </condition>
    <condition id="device.MK22D5">
      <accept Dvendor="NXP:11" Dname="MK22DN512???5"/>
      <accept Dvendor="NXP:11" Dname="MK22DX128???5"/>
      <accept Dvendor="NXP:11" Dname="MK22DX256???5"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
    </condition>
    <condition id="devices.MK22D5_platform.Include_core_cm4">
      <accept Dvendor="NXP:11" Dname="MK22DN512???5"/>
      <accept Dvendor="NXP:11" Dname="MK22DX128???5"/>
      <accept Dvendor="NXP:11" Dname="MK22DX256???5"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
    </condition>
    <condition id="devices.MK22DN512xxx5_mdk">
      <require Tcompiler="ARMCC"/>
      <accept Dvendor="NXP:11" Dname="MK22DN512???5"/>
    </condition>
    <condition id="devices.MK22DX128xxx5_mdk">
      <require Tcompiler="ARMCC"/>
      <accept Dvendor="NXP:11" Dname="MK22DX128???5"/>
    </condition>
    <condition id="devices.MK22DX256xxx5_mdk">
      <require Tcompiler="ARMCC"/>
      <accept Dvendor="NXP:11" Dname="MK22DX256???5"/>
    </condition>
